[{"fileName": "20190706.vision.html", "title": "TOGAF ADM Phase A - Architecture Vision", "intro": "Phase A, or Architecture Vision Phase comes after the Preliminary Phase, and it forms the first step in the ADM iteration cycle. The objectives of the Phase A include, defining a high-level architecture vi"}, {"fileName": "20190705.preliminary.html", "title": "The TOGAF Preliminary Phase", "intro": "Things begin with a business directive for an enterprise architecture. That is when the preliminary phase\n            begins. Here, we take care of preparation and initiation related activities. Unlike the"}, {"fileName": "20190704.architecturescope.html", "title": "TOGAF - The Architecture Scope", "intro": "They say, <i>\"Work expands to fill the time available to do it\"</i>. Similarly, architecture updates expand\n            to scratch all that is available for change. It needs to be restricted. The Architect"}, {"fileName": "20190703.conceptaudioprocessing.html", "title": "Audio Processing", "intro": "Sound is an important aspect of nature. For us, it is a major source of information and entertainment. Words form an important part of auditory signals. But there is a lot more to it than just words. Our m"}, {"fileName": "20190703.architecturalgovernance.html", "title": "Architecture Governance in TOGAF", "intro": "The ADM (or its adapted version) is an important document generated and managed in the ADM - like the other\n            architecture artefacts managed in the Enterprise Continuum. The ADM (or its adapted v"}, {"fileName": "20190702.awstranscribe.html", "title": "AWS Transcribe", "intro": "The Amazon Transcribe service can be used to recognize speech in audio files and convert it to text. It can identify the individual speakers in an audio clip. We can use it to convert audio to text and to "}, {"fileName": "20190702.adaptadm.html", "title": "Adapting the TOGAF ADM", "intro": "ADM provides a generic method for architecture development. But it is not a \"one size - fit all\" kind of a\n            framework. It provides tools and guidelines that can be adapted and used for any enter"}, {"fileName": "20190701.introductiontoadm.html", "title": "Introduction to TOGAF ADM", "intro": "The TOGAF standard provides an architecture framework. It provides the required tools and methods that can\n            assist in the different phases of an Enterprise Architecture, including acceptance, pr"}, {"fileName": "20190601.ea.html", "title": "Enterprise Architecture", "intro": "A good Enterprise Architecture is an important step leading maturity of enterprise. the open group advocates the need for a consistent architecture across the enterprise to enable information flow across t"}]